mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54605_DFP.12.0.0.pdsc
    <condition id="device.LPC54605_AND_driver.lpc_dma_AND_driver.spifi">
      <accept Dname="LPC54605J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54605J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spifi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54605_AND_utility.debug_console">
      <accept Dname="LPC54605J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54605J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54605_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54605J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54605J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54605_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="LPC54605J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54605J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54605" Cversion="1.0.0" condition="device.LPC54605_AND_component.serial_manager_uart_AND_component.usart_adapter_AND_device.LPC54605_startup_AND_driver.clock_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.reset_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.LPC54605_AND_driver.lpc_dma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.LPC54605_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.LPC54605_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC54605_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="device.LPC54605_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_usart">
      <description/>
      <files>
        <file category="header" name="components/uart/uart.h"/>
        <file category="sourceC" name="components/uart/usart_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="LPC54605_startup" Cversion="1.0.0" condition="device.LPC54605_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_LPC54605.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_LPC54605.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54605J256_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54605J256_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54605J512_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/LPC54605J512_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54605J256_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54605J256_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54605J512_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/LPC54605J512_ram.icf"/>
        <file category="header" attr="config" name="LPC54605.h"/>
        <file category="header" attr="config" name="LPC54605_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_LPC54605.c"/>
        <file category="header" attr="config" name="system_LPC54605.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.LPC54605_AND_driver.common_AND_driver.power">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
        <file category="header" name="drivers/fsl_clock.h"/>
      </files>
    </component>
